# Постановка задачи
Общая информация
В группу компаний «Торгово-производственное объединение» входит 2 юридических лица.
ООО «Завод» является производителем продукции металло-конструкций, но не занимается
сбытом конечным клиентам.
ООО «Завод» продает производимую продукцию дочернему предприятию ООО «Продажи»,
которое, в свою очередь, продает ее оптом своим клиентам.
Оба юридических лица ведут учет в единой учетной системе, построенной на базе 1С с
каркасной конфигурацией
Нормативно-справочная информация
1. В учетной системе необходимо завести аналитику по юридическим лицам
группы компаний, чтобы при оформлении документов можно было выбирать,
от лица какой организации выполняется операция.
2. Необходимо где-то хранить отгрузочные цены номенклатуры, чтобы при
оформлении расходной накладной цена вставала бы в документ
автоматически. Цены номенклатуры могут периодически меняться.
3. Необходимо хранить фотографию номенклатуры
Справочник номенклатура
У пользователя должна быть возможность выбрать фото товара, фото должно сохраняться в
базе данных, форма карточки товара должна иметь превью.
Важно! При реализации использовать асинхронные процедуры / функции, без
использования модальных методов (без изменения свойства конфигурации
РежимИспользованияМодальности).
Документ Выпуск продукции
В конфигурацию
Документ Выпуск продукции
В конфигурацию необходимо добавить документ «Выпуск продукции».
В шапке документа выбирается юридическое лицо, в табличной части указывается
номенклатура, количество, себестоимость за единицу выпускаемой продукции.
При сохранении документа должен происходить расчет итоговой суммы документа (реквизит
шапки).
При проведении учесть, что в строках может быть одинаковая продукция, в регистр
необходимо записывать итоговое количество (использовать запрос).
При проведении документ увеличивает остатки в регистре ОстаткиНоменклатуры,
дополнительно необходимо реализовать партионный учет по методу ФИФО (формирование
приходной партии).
Документ Расходная накладная
В шапке документа должна выбираться организация, от имени которой осуществляется
отгрузка и контрагент.
При сохранении документа должен происходить расчет итоговой суммы документа.
В табличной части с номенклатурой, при выборе номенклатуры из справочника, должны
заполняться колонки Цена (актуальная на дату документа) и Сумма.
Колонки цена и сумма не должны быть доступны для редактирования. Документ не должен
проводится, если в одной из строк не заполнена сумма.
При проведении должно происходить списание партии товаров, определяться себестоимость
по методу ФИФО.
Выручка, себестоимость и валовая прибыль (разница выручки и себестоимости) должны
сохраняться в оборотном регистре Валовая прибыль в разрезе номенклатуры.
Необходимо реализовать печатную форму расходной накладной в виде таблицы
(использовать запрос):
Важно! Реализовывать заполнение печатной формы строго в соответствии с
примером ниже (конструктор печатных форм выдает отличную от требуемой форму)
